import 'package:flutter/material.dart';

class BookReader extends StatefulWidget {
  final String bookName;

  const BookReader({Key key, this.bookName}) : super(key: key);

  @override
  State<StatefulWidget> createState() => _BookReaderState();
}

class _BookReaderState extends State<BookReader> {
  String all =
      "“柳姑娘，这位就是徐先。”元见真人用眼神示意徐先不要乱说话，然后才看向柳心蝉道。元见真人的表情很平静，不过徐先还是注意到，他明明是直视前方，却在刻意用余光看人。“不敢看？有这么夸张吗？”徐先不由有些好笑。元见真人大小也算是个人物了，徐先还是第一次见他连正眼看人都不敢，柳心蝉真有这么大的魔力？　　徐先抬头看了看，柳心蝉依旧是那副恬静的神色，似乎没有什么事能让她动容一般，面对元见真人的话，也只是点头轻笑。说实话，徐先实在看不出她有什么特别的——长得好看，气质好，符合这种特质的不说满大街都是，也不至于到绝无仅有的程度。　　不说徐先有多想不通，柳心蝉已经站起身来道：“有劳掌教师兄和元见师兄引荐，徐师弟……”“等一下。”徐先当场就挑了挑眉打断道。“你才要等一下！”元见真人连忙插嘴道，“这可是柳姑娘，你别乱来……”　　“什么乱来？元见师弟，这就是你的不对了。”徐先一把拨开他道，“柳姑娘唤你师兄，你又是我师弟，难道我不应该是她师兄？”元见真人简直气得肝疼，他平素懒得跟徐先计较，不跟他逞口舌之利，哪知道会演变成今天这种局面？　　柳心蝉倒是抿嘴轻笑，反而没怎么感到奇怪。　　她早年在岛中历练时，就被冠以“湖心岛第一美人”的称号，见过以各种方式搭讪的人自然也不知凡几。　　像徐先这样欲擒故纵，故意引起她注意的人，当然也不是第一个。　　有时候连柳心蝉自己也不明白，那些一个个看起来这么正经的人，怎么在自己面前就变得颠三倒四了呢？　　在这方面有着丰富经验的柳心蝉，便笑着开口道：“徐师弟说笑了，你入门不过年余，又怎么会是元见师兄的师兄？”　　徐先却没有说笑，反而一脸认真地说道：“柳师妹，我不怕把实话告诉你——”　　“我知道你这趟是为徐文婧而来，怀疑她是血界转生之人……那你可曾想过，我徐先也是转世之人？”　　“哎？”　　徐先这话不只让柳心蝉一怔，就连元见真人都有些愣住了，不知道他这又是演得哪一出。　　不过要说徐先也是大修转世，这话说出来倒是很有市场的，毕竟他的实力进展太快，甚至比徐文婧都快。　　就连上方的玄通真人，此时也是微微皱眉道：“徐先，这话可不能乱说，血界之事事关重大……”　　“哦，掌教师兄误会了。”徐先连连摆手道，“成丹之后，我已经觉醒了前世的大部分记忆，与血界却是无关的。”　　“徐某前世亦为道门弟子，在一处小世界意外结丹，一直没有机会回到岛上，神魂近些年才得以转生……”　　元见真人嘴角直抽，已经八成笃定徐先是在胡扯：“你说你前世是道门弟子，道号为何？”　　徐先当即转过头来，一本正经地回道：“我前世本名唐三藏，九岁便拜入道门，被恩师收为记名弟子，道号玄奘……”　　“元见师弟，我成丹时你还没入门呢，自然不记得我。”　　或许是徐先的表情太过正经，连元见真人都有些不确定起来——万一是真的呢？徐先如此在意称呼的问题，说不定还真是有前世的关系……　　元见真人陷入纠结，柳心蝉见他这模样，又看看神情严肃的徐先，一时间也无从开口。　　包括坐在首座上的玄通真人，脑中也在快速思索着陈年往事——到底有没有一个道号玄奘的弟子？　　徐先这货鸡贼的地方就在于，他一句“在小世界结丹”，就让人无法证明他说得是假话。　　毕竟玄字辈弟子那么多，当年的名册也早已不全，要是金丹境还能给人留下印象，真元境弟子那谁能记得住？　　殿内陷入了一片难言的沉默，片刻后，柳心蝉终于忍不住，首先打破了沉默：“徐师……兄，不知你的前世……和徐文婧有何关系？”　　“哦，没关系，我不认识她。”徐先摆了摆手，又指着自己道，“我只是想强调一下，你们应该尊重我这个老前辈。”　　“呵呵呵……”　　柳心蝉觉得自己这辈子以来，都没有笑得这么尴尬过。　　方才对徐先的看法已经被她全盘推翻，这种当着道门掌教的面，也要强行掌控住谈话节奏的家伙，远没有那么肤浅。　　“既然如此，徐师兄，我们还是谈正事吧。”柳心蝉努力把话题引回到正途上。　　“事情的始末相信师兄已经清楚，心蝉此行是想请师兄帮忙，找出徐文婧的踪迹。师兄已经成丹，只要有一缕血脉……”　　“不帮。”　　“什么？”　　徐先摸了摸下巴，这才饶有兴致地望着柳心蝉：“我是说，我不帮你。”　　“若徐文婧神魂已受血界污染，她一旦成丹，后果不堪设想……”　　“关我屁事？”　　“师兄若坐视生灵涂炭，难道不会道心不安，将来……”　　“关你屁事？”　　“你……”　　事实证明，再大的事情都可以用这两句话完美应对。　　柳心蝉上百年的涵养，一时间竟然被徐先气得说不出话来，连嘴唇都咬得发白。　　那边侍立的冲临道人忍不住道：“我等修道之人……”　　“冲临师侄也有话说？”　　“我，我不是……”　　连一旁的元见真人都看不下去了，扶了下额头道：“徐先，你也不要太过……”　　“元见师弟啊，镇字天书我还没完全看懂，有时间我们探讨下？”　　“得，当我没说。”　　元见真人的心都在滴血，他本来没把一本镇字天书放在眼里，哪怕被徐先坑了去也没什么，毕竟玄商组织不差这点道功。　　哪知道徐先居然转头拿这个来威胁自己……　　这要是逼急了，徐先是绝对敢把两人的对话和盘托出的，元见真人比谁都清楚这一点。　　他先前的担忧果然是正确的，面对源星居和柳心蝉，徐先这疯子居然打算硬顶回去……　　不过很快地，元见真人又开始幸灾乐祸起来——这烂摊子终究要有人来收拾的，交给别人头疼去吧！　　柳心蝉已经克制住了手抖，转过头来看向“别人”：“掌教师兄，这件事还请您给心蝉，给源星居一个交代。”";
  int index = 0;
  int size = 500;

  String content = "ac";

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: Text(this.widget.bookName),
        ),
        body: GestureDetector(
          onTap: getSplitContent,
          child: Container(
              padding:
                  EdgeInsets.only(left: 20, right: 20, top: 20, bottom: 20),
              child: Text(
                content,
                style: TextStyle(
                    letterSpacing: 1.5,
                    height: 1.8,
                    fontSize: 12,
                    color: Colors.black),
              )),
        ));
  }

  void getSplitContent() {
    print("###");
    setState(() {
      int last = (index + 1) * 500;
      if (last > all.length) {
        content = all.substring(index * 500);
      } else {
        content = all.substring(index * 500, last);
        index += 1;
      }
    });
  }
}
